Q.No.1

In [1]:
import pandas as pd

In [3]:
ser=pd.Series([4,8,15,16,23,42])

In [4]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
type(ser)

pandas.core.series.Series

Q.No.3

In [9]:
df=pd.DataFrame({
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']})

In [10]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

Q.No.4

DataFrame in pandas is a datastructure where the datas can be stored in tables. It stores in the same way the spreadsheets does or like SQL.
Series can be simply understood as one of the colums of DataFrame. It is also a datastructure which stores data in a single row.

In [12]:
#Eg of data frame is 
df              #defined in Q.No.3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
#Eg of Series is
ser     #defined in Q.NO. 1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q.NO.5

Some of the functions used to manipulate datas in dataframes are:
    dropna()
    head()
    tail()
    reset_index()
    replace()

In [25]:
##Creating a dataFrame:
df1=pd.DataFrame({
    'Course':['DataScience','C++','Java','Django','Flask'],
    'Mentor':['Ram','Kushal','Hari','Mohan','Sita'],
    'Duration':[6,2,3,2,1],
    'Price':[3500,2000,3500,1500,1000]})

In [16]:
df1

        Course  Mentor  Duration  Price
0  DataScience     Ram         6   3500
1          C++  Kushal         2   2000
2         Java    Hari         3   3500
3       Django   Mohan         2   1500
4        Flask    Sita         1   1000

In [17]:
df1.dropna()

        Course  Mentor  Duration  Price
0  DataScience     Ram         6   3500
1          C++  Kushal         2   2000
2         Java    Hari         3   3500
3       Django   Mohan         2   1500
4        Flask    Sita         1   1000

In [28]:
df1.replace([6,2,3,2,1],[6,3,2,2,1],inplace=True)

In [31]:
df1.drop('Mentor',axis=1)

        Course  Duration  Price
0  DataScience         6   3500
1          C++         2   2000
2         Java         2   3500
3       Django         2   1500
4        Flask         1   1000

Q.No.6

 DataFrame and Series are Mutable is Nature, which can also be seen from the example of Q.NO.5

Q.NO.7

In [32]:
Country=pd.Series(['Australia','India','Nepal','Bhutan'])
Capital=pd.Series(['Canberra','New Delhi','Kathmandu','Thimpu'])
Area=pd.Series([1000,950,700,450])

In [33]:
df2=pd.DataFrame({
    'Country':Country,
    'Capital':Capital,
    'Area':Area})

In [34]:
df2

     Country    Capital  Area
0  Australia   Canberra  1000
1      India  New Delhi   950
2      Nepal  Kathmandu   700
3     Bhutan     Thimpu   450